
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.0   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

3-user 8-core Stata network perpetual license:
       Serial number:  501306208483
         Licensed to:  IDRE-UCLA
                       IDRE-UCLA

Notes:
      1.  (/v# option or -set maxvar-) 5000 maximum variables
      2.  Stata running in batch mode


running C:\Program Files (x86)\Stata13\profile.do ...
r; t=0.00 10:40:29

. do "C:\Users\Apoorva Lal\Desktop\Research\Nepal_Voting\analysis\code\_main.do" 

. //----------------------------------------------------------------------------//
. //
. // Paper: Analysis of voting patterns Nepal
. //
. // do.file: analysis
. //
. // Author(s): Apoorva Lal
. //
. //----------------------------------------------------------------------------//
. 
. //----------------------------------------------------------------------------//
. // Shortcuts
. //----------------------------------------------------------------------------//
. 
. gl sys "win" // mac or win - change when switching systems
r; t=0.00 10:40:29

. gl path_win "C:/Users/Apoorva Lal/Desktop/Research/Nepal_Voting/analysis/"
r; t=0.00 10:40:29

. gl path_mac "/Users/apoorvalal/Desktop/projects/nepal_voting_patterns/analysis"
r; t=0.00 10:40:29

. 
. gl path "${path_${sys}}"
r; t=0.00 10:40:29

. 
. gl input "${path}/input" 
r; t=0.00 10:40:29

. gl output "${path}/output"
r; t=0.00 10:40:29

. gl code_win "${path_win}/code/"
r; t=0.00 10:40:29

. gl code_mac "${path_mac}/code/"
r; t=0.00 10:40:29

. gl code "${code_${sys}}" 
r; t=0.00 10:40:29

. 
. gl tmp "${path}/tmp"
r; t=0.00 10:40:29

. 
. // Data Sources
. gl raw_2011 "${input}/Nepal Census 2011/pums/assets/datafiles/"
r; t=0.00 10:40:29

. 
. cd "${input}"
C:\Users\Apoorva Lal\Desktop\Research\Nepal_Voting\analysis\input
r; t=0.00 10:40:29

. 
. 
. //----------------------------------------------------------------------------//
. // Preface
. //----------------------------------------------------------------------------//
. 
. // log using "$path/analysis/output/analysis.log"
. cap log close
r; t=0.02 10:40:29

. clear all
r; t=0.18 10:40:29

. //  set graphics off
. 
. cd "${code}/"
C:\Users\Apoorva Lal\Desktop\Research\Nepal_Voting\analysis\code
r; t=0.00 10:40:29

. 
. /* 
> General Macros
>  */
. 
.  set tracedepth 1
r; t=0.00 10:40:29

.  set r on, perm
(set rmsg preference recorded)
r; t=0.00 10:40:29

.  pause on
r; t=0.03 10:40:29

.  
. //----------------------------------------------------------------------------//
. // Main
. //----------------------------------------------------------------------------//
. 
. // do "${code}/sub/c2011_0_extract_labels"
. // do "${code}/sub/c2011_1_clean_hh_data"
. // do "${code}/sub/c2011_1_clean_ind_data"
. do "${code}/sub/c2011_2_hh_full"

. loc hh_id "DIST VDCMUN WARD EA HNO HHNO"
r; t=0.00 10:40:29

. loc dropvars "H01 H021 H022 H023 H024 H025 H03 H04 H05 H06 H07A H07B H07C H07D H07E
>  H07F H07G H07H H07I H07J H07K H07L H08 H09 H10B H10K H10D H10R H10A H10P H11 H11NO
>  H13 H13NO"
r; t=0.00 10:40:29

. 
. use "${tmp}/hh_w_geo_ids", clear
r; t=0.78 10:40:30

. merge 1:1 `hh_id' using "${tmp}/hh_level_caste", nogen
(label DIST already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           841,567  
    -----------------------------------------
r; t=0.73 10:40:30

. cap drop householdcount
r; t=0.00 10:40:30

. // bysort DistCons: egen HHcount = count(VDCMUN)
. egen Amenitiesindex = rownonmiss(H07A H07B H07C H07D H07E H07F H07G H07H H07I H07J 
> H07K H07L)
r; t=0.45 10:40:31

. g HouseholdQualIndex = (H022 == 2) + (H021 == 2) + (H021 == 4 | H021 == 3 | H022 ==
>  4)
r; t=0.05 10:40:31

. replace HouseholdQualIndex =  HouseholdQualIndex + H024
(841567 real changes made)
r; t=0.02 10:40:31

. label define HHQ 510 "Very High" 3 "High" 4 "High" 2 "Medium" 1 "Low"
r; t=0.00 10:40:31

. label values HouseholdQualIndex HHQ
r; t=0.00 10:40:31

. g WaterQualIndex = (H03 < 2) + (H03 < 3)
r; t=0.03 10:40:31

. g EnergyQualIndex = (H04 == 3 | H04 == 6 | H04 == 5) + (H05 == 1) + 0.5*(H05 == 4) 
> +  0.5*(H05 == 2 |H04 == 2)
r; t=0.07 10:40:31

. g SanitationQualIndex = (H06<3) + (H06<4)
r; t=0.03 10:40:31

. g GenderEquityPropertyIndex = (H08 == 1 | H 09 == 1)
r; t=0.02 10:40:31

. clonevar mig_count = H13NO 
(637512 missing values generated)
r; t=0.06 10:40:31

. 
. drop `dropvars'
r; t=0.02 10:40:31

. tempvar dist
r; t=0.00 10:40:31

. tempvar vil
r; t=0.00 10:40:31

. decode DNAME, g(`dist') 
r; t=0.10 10:40:31

. replace `dist' = trim(`dist')
(818687 real changes made)
r; t=0.17 10:40:31

. decode VNAME, g(`vil') 
r; t=0.22 10:40:32

. replace `vil' = trim(`vil')
(835884 real changes made)
r; t=0.20 10:40:32

. g village_id = `dist' + "-"+ `vil'
r; t=0.96 10:40:33

. 
. drop `dist' `vil'
r; t=0.03 10:40:33

. compress
  Amenitiesindex was float now byte
  HouseholdQualIndex was float now byte
  WaterQualIndex was float now byte
  SanitationQualIndex was float now byte
  GenderEquityPropertyIndex was float now byte
  (12,623,505 bytes saved)
r; t=0.60 10:40:33

. 
. save "${output}/c_2011_full", replace
file C:/Users/Apoorva Lal/Desktop/Research/Nepal_Voting/analysis//output/c_2011_full.
> dta saved
r; t=0.06 10:40:33

. 
end of do-file
r; t=4.63 10:40:33

. 
. 
. 
. 
end of do-file
r; t=4.88 10:40:33
